share_db={
{ id=1 , request=30 , reward='[{"id":90001,"num":100},{"id":90015,"num":20},{"id":90002,"num":200000}]' , des='战队等级达到30级' ,},
{ id=2 , request=4 , reward='[{"id":90001,"num":100},{"id":90015,"num":20},{"id":92,"num":2}]' , des='通关第四章火烧洛阳' ,},
{ id=3 , request=10 , reward='[{"id":90002,"num":100000},{"id":90015,"num":10},{"id":150002,"num":5}]' , des='竞技场胜利场次达到10次' ,},
{ id=4 , request=100 , reward='[{"id":90002,"num":100000},{"id":67,"num":10},{"id":68,"num":5}]' , des='竞技场进入前100名' ,},
{ id=5 , request=4 , reward='[{"id":90002,"num":100000},{"id":67,"num":5},{"id":68,"num":10}]' , des='任意武将升星到4星' ,},
{ id=6 , request=3 , reward='[{"id":90002,"num":100000},{"id":90015,"num":10},{"id":77,"num":10}]' , des='首次获得任意3星武将' ,},
}
